----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 16, 32, 32]             432
       BatchNorm2d-2           [-1, 16, 32, 32]              32
            Conv2d-3           [-1, 32, 32, 32]           4,608
       BatchNorm2d-4           [-1, 32, 32, 32]              64
            Conv2d-5           [-1, 32, 32, 32]           9,216
       BatchNorm2d-6           [-1, 32, 32, 32]              64
            Conv2d-7           [-1, 32, 32, 32]             512
       BatchNorm2d-8           [-1, 32, 32, 32]              64
        BasicBlock-9           [-1, 32, 32, 32]               0
           Conv2d-10           [-1, 32, 32, 32]           9,216
      BatchNorm2d-11           [-1, 32, 32, 32]              64
           Conv2d-12           [-1, 32, 32, 32]           9,216
      BatchNorm2d-13           [-1, 32, 32, 32]              64
       BasicBlock-14           [-1, 32, 32, 32]               0
           Conv2d-15           [-1, 32, 32, 32]           9,216
      BatchNorm2d-16           [-1, 32, 32, 32]              64
           Conv2d-17           [-1, 32, 32, 32]           9,216
      BatchNorm2d-18           [-1, 32, 32, 32]              64
       BasicBlock-19           [-1, 32, 32, 32]               0
           Conv2d-20           [-1, 32, 32, 32]           9,216
      BatchNorm2d-21           [-1, 32, 32, 32]              64
           Conv2d-22           [-1, 32, 32, 32]           9,216
      BatchNorm2d-23           [-1, 32, 32, 32]              64
       BasicBlock-24           [-1, 32, 32, 32]               0
           Conv2d-25           [-1, 32, 32, 32]           9,216
      BatchNorm2d-26           [-1, 32, 32, 32]              64
           Conv2d-27           [-1, 32, 32, 32]           9,216
      BatchNorm2d-28           [-1, 32, 32, 32]              64
       BasicBlock-29           [-1, 32, 32, 32]               0
           Conv2d-30           [-1, 32, 32, 32]           9,216
      BatchNorm2d-31           [-1, 32, 32, 32]              64
           Conv2d-32           [-1, 32, 32, 32]           9,216
      BatchNorm2d-33           [-1, 32, 32, 32]              64
       BasicBlock-34           [-1, 32, 32, 32]               0
           Conv2d-35           [-1, 32, 32, 32]           9,216
      BatchNorm2d-36           [-1, 32, 32, 32]              64
           Conv2d-37           [-1, 32, 32, 32]           9,216
      BatchNorm2d-38           [-1, 32, 32, 32]              64
       BasicBlock-39           [-1, 32, 32, 32]               0
           Conv2d-40           [-1, 32, 32, 32]           9,216
      BatchNorm2d-41           [-1, 32, 32, 32]              64
           Conv2d-42           [-1, 32, 32, 32]           9,216
      BatchNorm2d-43           [-1, 32, 32, 32]              64
       BasicBlock-44           [-1, 32, 32, 32]               0
           Conv2d-45           [-1, 32, 32, 32]           9,216
      BatchNorm2d-46           [-1, 32, 32, 32]              64
           Conv2d-47           [-1, 32, 32, 32]           9,216
      BatchNorm2d-48           [-1, 32, 32, 32]              64
       BasicBlock-49           [-1, 32, 32, 32]               0
           Conv2d-50           [-1, 32, 32, 32]           9,216
      BatchNorm2d-51           [-1, 32, 32, 32]              64
           Conv2d-52           [-1, 32, 32, 32]           9,216
      BatchNorm2d-53           [-1, 32, 32, 32]              64
       BasicBlock-54           [-1, 32, 32, 32]               0
           Conv2d-55           [-1, 32, 32, 32]           9,216
      BatchNorm2d-56           [-1, 32, 32, 32]              64
           Conv2d-57           [-1, 32, 32, 32]           9,216
      BatchNorm2d-58           [-1, 32, 32, 32]              64
       BasicBlock-59           [-1, 32, 32, 32]               0
           Conv2d-60           [-1, 32, 32, 32]           9,216
      BatchNorm2d-61           [-1, 32, 32, 32]              64
           Conv2d-62           [-1, 32, 32, 32]           9,216
      BatchNorm2d-63           [-1, 32, 32, 32]              64
       BasicBlock-64           [-1, 32, 32, 32]               0
           Conv2d-65           [-1, 32, 32, 32]           9,216
      BatchNorm2d-66           [-1, 32, 32, 32]              64
           Conv2d-67           [-1, 32, 32, 32]           9,216
      BatchNorm2d-68           [-1, 32, 32, 32]              64
       BasicBlock-69           [-1, 32, 32, 32]               0
           Conv2d-70           [-1, 64, 16, 16]          18,432
      BatchNorm2d-71           [-1, 64, 16, 16]             128
           Conv2d-72           [-1, 64, 16, 16]          36,864
      BatchNorm2d-73           [-1, 64, 16, 16]             128
           Conv2d-74           [-1, 64, 16, 16]           2,048
      BatchNorm2d-75           [-1, 64, 16, 16]             128
       BasicBlock-76           [-1, 64, 16, 16]               0
           Conv2d-77           [-1, 64, 16, 16]          36,864
      BatchNorm2d-78           [-1, 64, 16, 16]             128
           Conv2d-79           [-1, 64, 16, 16]          36,864
      BatchNorm2d-80           [-1, 64, 16, 16]             128
       BasicBlock-81           [-1, 64, 16, 16]               0
           Conv2d-82           [-1, 64, 16, 16]          36,864
      BatchNorm2d-83           [-1, 64, 16, 16]             128
           Conv2d-84           [-1, 64, 16, 16]          36,864
      BatchNorm2d-85           [-1, 64, 16, 16]             128
       BasicBlock-86           [-1, 64, 16, 16]               0
           Conv2d-87           [-1, 64, 16, 16]          36,864
      BatchNorm2d-88           [-1, 64, 16, 16]             128
           Conv2d-89           [-1, 64, 16, 16]          36,864
      BatchNorm2d-90           [-1, 64, 16, 16]             128
       BasicBlock-91           [-1, 64, 16, 16]               0
           Conv2d-92           [-1, 64, 16, 16]          36,864
      BatchNorm2d-93           [-1, 64, 16, 16]             128
           Conv2d-94           [-1, 64, 16, 16]          36,864
      BatchNorm2d-95           [-1, 64, 16, 16]             128
       BasicBlock-96           [-1, 64, 16, 16]               0
           Conv2d-97           [-1, 64, 16, 16]          36,864
      BatchNorm2d-98           [-1, 64, 16, 16]             128
           Conv2d-99           [-1, 64, 16, 16]          36,864
     BatchNorm2d-100           [-1, 64, 16, 16]             128
      BasicBlock-101           [-1, 64, 16, 16]               0
          Conv2d-102           [-1, 64, 16, 16]          36,864
     BatchNorm2d-103           [-1, 64, 16, 16]             128
          Conv2d-104           [-1, 64, 16, 16]          36,864
     BatchNorm2d-105           [-1, 64, 16, 16]             128
      BasicBlock-106           [-1, 64, 16, 16]               0
          Conv2d-107           [-1, 64, 16, 16]          36,864
     BatchNorm2d-108           [-1, 64, 16, 16]             128
          Conv2d-109           [-1, 64, 16, 16]          36,864
     BatchNorm2d-110           [-1, 64, 16, 16]             128
      BasicBlock-111           [-1, 64, 16, 16]               0
          Conv2d-112           [-1, 64, 16, 16]          36,864
     BatchNorm2d-113           [-1, 64, 16, 16]             128
          Conv2d-114           [-1, 64, 16, 16]          36,864
     BatchNorm2d-115           [-1, 64, 16, 16]             128
      BasicBlock-116           [-1, 64, 16, 16]               0
          Conv2d-117           [-1, 64, 16, 16]          36,864
     BatchNorm2d-118           [-1, 64, 16, 16]             128
          Conv2d-119           [-1, 64, 16, 16]          36,864
     BatchNorm2d-120           [-1, 64, 16, 16]             128
      BasicBlock-121           [-1, 64, 16, 16]               0
          Conv2d-122           [-1, 64, 16, 16]          36,864
     BatchNorm2d-123           [-1, 64, 16, 16]             128
          Conv2d-124           [-1, 64, 16, 16]          36,864
     BatchNorm2d-125           [-1, 64, 16, 16]             128
      BasicBlock-126           [-1, 64, 16, 16]               0
          Conv2d-127           [-1, 64, 16, 16]          36,864
     BatchNorm2d-128           [-1, 64, 16, 16]             128
          Conv2d-129           [-1, 64, 16, 16]          36,864
     BatchNorm2d-130           [-1, 64, 16, 16]             128
      BasicBlock-131           [-1, 64, 16, 16]               0
          Conv2d-132           [-1, 64, 16, 16]          36,864
     BatchNorm2d-133           [-1, 64, 16, 16]             128
          Conv2d-134           [-1, 64, 16, 16]          36,864
     BatchNorm2d-135           [-1, 64, 16, 16]             128
      BasicBlock-136           [-1, 64, 16, 16]               0
          Conv2d-137            [-1, 128, 8, 8]          73,728
     BatchNorm2d-138            [-1, 128, 8, 8]             256
          Conv2d-139            [-1, 128, 8, 8]         147,456
     BatchNorm2d-140            [-1, 128, 8, 8]             256
          Conv2d-141            [-1, 128, 8, 8]           8,192
     BatchNorm2d-142            [-1, 128, 8, 8]             256
      BasicBlock-143            [-1, 128, 8, 8]               0
          Conv2d-144            [-1, 128, 8, 8]         147,456
     BatchNorm2d-145            [-1, 128, 8, 8]             256
          Conv2d-146            [-1, 128, 8, 8]         147,456
     BatchNorm2d-147            [-1, 128, 8, 8]             256
      BasicBlock-148            [-1, 128, 8, 8]               0
          Conv2d-149            [-1, 128, 8, 8]         147,456
     BatchNorm2d-150            [-1, 128, 8, 8]             256
          Conv2d-151            [-1, 128, 8, 8]         147,456
     BatchNorm2d-152            [-1, 128, 8, 8]             256
      BasicBlock-153            [-1, 128, 8, 8]               0
          Conv2d-154            [-1, 128, 8, 8]         147,456
     BatchNorm2d-155            [-1, 128, 8, 8]             256
          Conv2d-156            [-1, 128, 8, 8]         147,456
     BatchNorm2d-157            [-1, 128, 8, 8]             256
      BasicBlock-158            [-1, 128, 8, 8]               0
          Conv2d-159            [-1, 128, 8, 8]         147,456
     BatchNorm2d-160            [-1, 128, 8, 8]             256
          Conv2d-161            [-1, 128, 8, 8]         147,456
     BatchNorm2d-162            [-1, 128, 8, 8]             256
      BasicBlock-163            [-1, 128, 8, 8]               0
          Conv2d-164            [-1, 128, 8, 8]         147,456
     BatchNorm2d-165            [-1, 128, 8, 8]             256
          Conv2d-166            [-1, 128, 8, 8]         147,456
     BatchNorm2d-167            [-1, 128, 8, 8]             256
      BasicBlock-168            [-1, 128, 8, 8]               0
          Conv2d-169            [-1, 128, 8, 8]         147,456
     BatchNorm2d-170            [-1, 128, 8, 8]             256
          Conv2d-171            [-1, 128, 8, 8]         147,456
     BatchNorm2d-172            [-1, 128, 8, 8]             256
      BasicBlock-173            [-1, 128, 8, 8]               0
          Conv2d-174            [-1, 128, 8, 8]         147,456
     BatchNorm2d-175            [-1, 128, 8, 8]             256
          Conv2d-176            [-1, 128, 8, 8]         147,456
     BatchNorm2d-177            [-1, 128, 8, 8]             256
      BasicBlock-178            [-1, 128, 8, 8]               0
          Conv2d-179            [-1, 128, 8, 8]         147,456
     BatchNorm2d-180            [-1, 128, 8, 8]             256
          Conv2d-181            [-1, 128, 8, 8]         147,456
     BatchNorm2d-182            [-1, 128, 8, 8]             256
      BasicBlock-183            [-1, 128, 8, 8]               0
          Conv2d-184            [-1, 128, 8, 8]         147,456
     BatchNorm2d-185            [-1, 128, 8, 8]             256
          Conv2d-186            [-1, 128, 8, 8]         147,456
     BatchNorm2d-187            [-1, 128, 8, 8]             256
      BasicBlock-188            [-1, 128, 8, 8]               0
          Conv2d-189            [-1, 128, 8, 8]         147,456
     BatchNorm2d-190            [-1, 128, 8, 8]             256
          Conv2d-191            [-1, 128, 8, 8]         147,456
     BatchNorm2d-192            [-1, 128, 8, 8]             256
      BasicBlock-193            [-1, 128, 8, 8]               0
          Conv2d-194            [-1, 128, 8, 8]         147,456
     BatchNorm2d-195            [-1, 128, 8, 8]             256
          Conv2d-196            [-1, 128, 8, 8]         147,456
     BatchNorm2d-197            [-1, 128, 8, 8]             256
      BasicBlock-198            [-1, 128, 8, 8]               0
          Conv2d-199            [-1, 128, 8, 8]         147,456
     BatchNorm2d-200            [-1, 128, 8, 8]             256
          Conv2d-201            [-1, 128, 8, 8]         147,456
     BatchNorm2d-202            [-1, 128, 8, 8]             256
      BasicBlock-203            [-1, 128, 8, 8]               0
          Linear-204                   [-1, 10]           1,290
================================================================
Total params: 4,959,770
Trainable params: 4,959,770
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 29.56
Params size (MB): 18.92
Estimated Total Size (MB): 48.49
----------------------------------------------------------------
Model weights loaded
total: 10000
total correct: 9479
Model accuracy on test dataset: 94.79%